/*
 Navicat Premium Data Transfer

 Source Server         : docker.local
 Source Server Type    : MySQL
 Source Server Version : 80033
 Source Host           : 127.0.0.1:3306
 Source Schema         : fund_analye_system

 Target Server Type    : MySQL
 Target Server Version : 80033
 File Encoding         : 65001

 Date: 17/07/2023 13:37:58
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for fas_fund_basis
-- ----------------------------
DROP TABLE IF EXISTS `fas_fund_basis`;
CREATE TABLE `fas_fund_basis` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  `updated_at` datetime DEFAULT NULL COMMENT '更新时间',
  `deleted_at` datetime DEFAULT NULL COMMENT '删除时间',
  `code` char(6) NOT NULL DEFAULT '' COMMENT '基金代码',
  `full_name` varchar(50) DEFAULT NULL COMMENT '基金全称',
  `short_name` varchar(20) DEFAULT NULL COMMENT '基金简称',
  `main_type` varchar(20) DEFAULT NULL COMMENT '基金主类型',
  `sub_type` varchar(20) DEFAULT NULL COMMENT '基金子类型',
  `company` varchar(50) DEFAULT NULL COMMENT '基金公司',
  `manager` varchar(20) NOT NULL DEFAULT '' COMMENT '基金经理人',
  `manager_desc` varchar(255) DEFAULT NULL COMMENT '基金经理人介绍',
  `release_date` varchar(12) DEFAULT NULL COMMENT '发布时间',
  `establish_date` varchar(12) DEFAULT NULL COMMENT '成立时间',
  `establish_shares` decimal(12,4) DEFAULT NULL COMMENT '成立时规模(单位:亿份)',
  `manage_fee_rate` decimal(4,2) DEFAULT NULL COMMENT '管理费率(百分比)',
  `custody_fee_rate` decimal(4,2) DEFAULT NULL COMMENT '托管费率(百分比)',
  `sale_fee_rate` decimal(4,2) DEFAULT NULL COMMENT '销售服务费率(百分比)',
  `benchmark` varchar(255) DEFAULT NULL COMMENT '业绩比较基准',
  `sync_stock` tinyint DEFAULT '0' COMMENT '是否同步股票持仓, 1:是 0:否',
  PRIMARY KEY (`id`),
  UNIQUE KEY `code` (`code`),
  KEY `idx_fas_fund_basis_deleted_at` (`deleted_at`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8mb3 COMMENT='基金表';

-- ----------------------------
-- Records of fas_fund_basis
-- ----------------------------
BEGIN;
INSERT INTO `fas_fund_basis` VALUES (1, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '007937', '华夏饲料豆粕期货交易型开放式证券投资基金发起式联接基金', '华夏饲料豆粕期货ETF联接A', '商品（不含QDII）', '', '华夏基金', '华龙', 'fund.eastmoney.com/manager/30776478.html', '2019-12-19', '2020-01-13', 2.9030, 0.50, 0.10, 0.00, '大连商品交易所豆粕期货价格指数收益率×95%+人民币活期存款税后利率×5%', 0);
INSERT INTO `fas_fund_basis` VALUES (2, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '519212', '万家宏观择时多策略灵活配置混合型证券投资基金', '万家宏观择时多策略混合', '混合型', '灵活', '万家基金', '黄海', 'fund.eastmoney.com/manager/30050327.html', '2017-02-27', '2017-03-30', 5.1110, 1.50, 0.25, 0.00, '沪深300指数收益率*50%+中证全债指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (3, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '011443', '创金合信鑫瑞混合型证券投资基金', '创金合信鑫瑞混合C', '混合型', '偏债', '创金合信基金', '王一兵', 'fund.eastmoney.com/manager/30056585.html', '2021-02-05', '2021-04-26', 2.0540, 0.80, 0.10, 0.40, '沪深300指数收益率*20%+中债综合指数收益率*80%', 0);
INSERT INTO `fas_fund_basis` VALUES (4, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '162607', '景顺长城资源垄断混合型证券投资基金(LOF)', '景顺长城资源垄断混合', '混合型', '偏股', '景顺长城基金', '韩文强', 'fund.eastmoney.com/manager/30683404.html', '2005-12-19', '2006-01-26', 11.5520, 1.50, 0.25, 0.00, '沪深300指数*80%+中国债券总指数*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (5, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '008906', '嘉合锦鹏添利混合型证券投资基金', '嘉合锦鹏添利混合C', '混合型', '偏债', '嘉合基金', '于启明、季慧娟', 'fund.eastmoney.com/manager/30176648.html', '2020-04-13', '2020-04-29', 6.7020, 0.80, 0.20, 0.40, '中证全债指数收益率*80%+沪深300指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (6, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '004475', '华泰柏瑞富利灵活配置混合型证券投资基金', '华泰柏瑞富利混合A', '混合型', '灵活', '华泰柏瑞基金', '董辰', 'fund.eastmoney.com/manager/30709350.html', '2017-08-10', '2017-09-12', 13.8740, 1.50, 0.25, 0.00, '沪深300指数收益率*50%+中债综合指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (7, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009499', '景顺长城安鑫回报一年持有期混合型证券投资基金', '景顺长城安鑫回报混合A', '混合型', '偏债', '景顺长城基金', '韩文强、赵天彤', 'fund.eastmoney.com/manager/30683404.html', '2020-07-06', '2020-07-10', 5.8190, 0.70, 0.20, 0.00, '中证综合债指数收益率*90%+沪深300指数收益率*10%', 0);
INSERT INTO `fas_fund_basis` VALUES (8, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '003175', '华泰柏瑞多策略灵活配置混合型证券投资基金', '华泰柏瑞多策略混合A', '混合型', '灵活', '华泰柏瑞基金', '董辰', 'fund.eastmoney.com/manager/30709350.html', '2016-08-25', '2016-09-29', 5.0140, 1.50, 0.25, 0.00, '沪深300指数收益率*60%+上证国债指数收益率*40%', 0);
INSERT INTO `fas_fund_basis` VALUES (9, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '012610', '安信稳健汇利一年持有期混合型证券投资基金', '安信稳健汇利一年持有混合C', '混合型', '偏债', '安信基金', '张翼飞、李君', 'fund.eastmoney.com/manager/30283265.html', '2021-07-26', '2021-08-10', 20.8440, 0.80, 0.20, 0.40, '中证800指数收益率×15%+恒生指数收益率(经汇率调整)×5%+中债总指数(全价)收益率×80%', 0);
INSERT INTO `fas_fund_basis` VALUES (10, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002662', '前海开源沪港深大消费主题精选灵活配置混合型证券投资基金', '前海开源沪港深大消费混合A', '混合型', '灵活', '前海开源基金', '田维、王霞', 'fund.eastmoney.com/manager/30706233.html', '2016-09-01', '2016-09-29', 5.4900, 1.50, 0.25, 0.00, '沪深300指数收益率×70%+中证全债指数收益率×30%', 0);
INSERT INTO `fas_fund_basis` VALUES (11, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '350002', '天治低碳经济灵活配置混合型证券投资基金', '天治低碳经济混合', '混合型', '灵活', '天治基金', '许家涵', 'fund.eastmoney.com/manager/30200510.html', '2004-11-29', '2005-01-12', 12.1260, 1.50, 0.25, 0.00, '中证内地低碳经济主题指数收益率×50%+中证全债指数收益率×50%', 0);
INSERT INTO `fas_fund_basis` VALUES (12, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001832', '易方达瑞恒灵活配置混合型证券投资基金', '易方达瑞恒灵活配置混合', '混合型', '灵活', '易方达基金', '萧楠、王元春', 'fund.eastmoney.com/manager/30189741.html', '2017-11-10', '2018-01-10', 6.9010, 0.60, 0.15, 0.00, '沪深300指数收益率×25%+一年期人民币定期存款利率(税后)×75%', 0);
INSERT INTO `fas_fund_basis` VALUES (13, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '000218', '国泰黄金交易型开放式证券投资基金联接基金', '国泰黄金ETF联接A', '商品（不含QDII）', '', '国泰基金', '艾小军', 'fund.eastmoney.com/manager/30277862.html', '2016-04-05', '2016-04-13', 4.0960, 0.50, 0.10, 0.00, '上海黄金交易所挂盘交易的Au99.99合约收益率×95%+银行活期存款税后收益率×5%', 0);
INSERT INTO `fas_fund_basis` VALUES (14, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001247', '华泰柏瑞新利灵活配置混合型证券投资基金', '华泰柏瑞新利混合A', '混合型', '灵活', '华泰柏瑞基金', '郑青、董辰', 'fund.eastmoney.com/manager/30176370.html', '2015-04-22', '2015-04-28', 16.5270, 0.80, 0.25, 0.00, '一年期银行定期存款利率(税后)+1%', 0);
INSERT INTO `fas_fund_basis` VALUES (15, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '006547', '红塔红土盛弘灵活配置混合型发起式证券投资基金', '红塔红土盛弘混合A', '混合型', '灵活', '红塔红土', '赵耀', 'fund.eastmoney.com/manager/30295855.html', '2018-10-25', '2018-11-06', 0.1010, 0.60, 0.20, 0.00, '沪深300指数收益率×55%+中债总指数(财富)收益率×45%', 0);
INSERT INTO `fas_fund_basis` VALUES (16, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '007938', '华夏饲料豆粕期货交易型开放式证券投资基金发起式联接基金', '华夏饲料豆粕期货ETF联接C', '商品（不含QDII）', '', '华夏基金', '华龙', 'fund.eastmoney.com/manager/30776478.html', '2019-12-19', '2020-01-13', 2.9030, 0.50, 0.10, 0.30, '大连商品交易所豆粕期货价格指数收益率×95%+人民币活期存款税后利率×5%', 0);
INSERT INTO `fas_fund_basis` VALUES (17, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009755', '景顺长城安鑫回报一年持有期混合型证券投资基金', '景顺长城安鑫回报混合C', '混合型', '偏债', '景顺长城基金', '韩文强、赵天彤', 'fund.eastmoney.com/manager/30683404.html', '2020-07-06', '2020-07-10', 5.8190, 0.70, 0.20, 0.40, '中证综合债指数收益率*90%+沪深300指数收益率*10%', 0);
INSERT INTO `fas_fund_basis` VALUES (18, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '011891', '易方达先锋成长混合型证券投资基金', '易方达先锋成长混合A', '混合型', '偏股', '易方达基金', '武阳', 'fund.eastmoney.com/manager/30359246.html', '2021-09-01', '2021-09-23', 5.7060, 1.50, 0.25, 0.00, '中证500指数收益率*65%+中证港股通综合指数收益率*20%+中债总指数收益率*15%', 0);
INSERT INTO `fas_fund_basis` VALUES (19, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '012701', '安信民安回报一年持有期混合型证券投资基金', '安信民安回报一年持有混合A', '混合型', '偏债', '安信基金', '张翼飞、李君', 'fund.eastmoney.com/manager/30283265.html', '2021-08-16', '2021-09-07', 7.9060, 0.50, 0.15, 0.00, '中债综合(全价)指数收益率*85%+沪深300指数收益率*10%+恒生指数收益率(经汇率调整后)*5%', 0);
INSERT INTO `fas_fund_basis` VALUES (20, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009098', '景顺长城价值领航两年持有期混合型证券投资基金', '景顺长城价值领航混合', '混合型', '偏股', '景顺长城基金', '鲍无可', 'fund.eastmoney.com/manager/30289521.html', '2020-03-05', '2020-03-23', 17.4700, 0.80, 0.25, 0.00, '沪深300指数收益率*80%+中债综合指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (21, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '000314', '招商瑞丰灵活配置混合型发起式证券投资基金', '招商瑞丰灵活配置混合发起式A', '混合型', '灵活', '招商基金', '王刚', 'fund.eastmoney.com/manager/30524321.html', '2013-10-14', '2013-11-06', 9.3030, 0.60, 0.15, 0.00, '60%×沪深300指数收益率+40%×中债综合指数收益率', 0);
INSERT INTO `fas_fund_basis` VALUES (22, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '005233', '广发睿毅领先混合型证券投资基金', '广发睿毅领先混合A', '混合型', '偏股', '广发基金', '林英睿', 'fund.eastmoney.com/manager/30137559.html', '2017-11-13', '2017-12-14', 2.6610, 1.50, 0.25, 0.00, '沪深300指数收益率*75%+中证全债指数收益率*25%', 0);
INSERT INTO `fas_fund_basis` VALUES (23, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '162717', '广发再融资主题灵活配置混合型证券投资基金(LOF)', '广发再融资主题(LOF)A', '混合型', '灵活', '广发基金', '田文舟', 'fund.eastmoney.com/manager/30672366.html', '2016-11-07', '2016-12-19', 3.1780, 0.60, 0.20, 0.00, '中证800指数收益率*55%+中证全债指数收益率*45%', 0);
INSERT INTO `fas_fund_basis` VALUES (24, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002663', '前海开源沪港深大消费主题精选灵活配置混合型证券投资基金', '前海开源沪港深大消费混合C', '混合型', '灵活', '前海开源基金', '田维、王霞', 'fund.eastmoney.com/manager/30706233.html', '2016-09-01', '2016-09-29', 5.4900, 1.50, 0.25, 0.10, '沪深300指数收益率×70%+中证全债指数收益率×30%', 0);
INSERT INTO `fas_fund_basis` VALUES (25, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '003591', '华泰柏瑞享利灵活配置混合型证券投资基金', '华泰柏瑞享利混合A', '混合型', '灵活', '华泰柏瑞基金', '郑青、董辰', 'fund.eastmoney.com/manager/30176370.html', '2016-12-21', '2016-12-29', 2.0000, 0.60, 0.15, 0.00, '沪深300指数收益率×50%+中债综合指数收益率×50%', 0);
INSERT INTO `fas_fund_basis` VALUES (26, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '470021', '汇添富优选回报灵活配置混合型证券投资基金', '汇添富优选回报灵活配置混合A', '混合型', '灵活', '汇添富基金', '赖中立、李威', 'fund.eastmoney.com/manager/30195060.html', '2013-01-15', '2013-01-24', 53.6490, 0.90, 0.25, 0.00, '沪深300指数收益率*50%+中债综合指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (27, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '006548', '红塔红土盛弘灵活配置混合型发起式证券投资基金', '红塔红土盛弘混合C', '混合型', '灵活', '红塔红土', '赵耀', 'fund.eastmoney.com/manager/30295855.html', '2018-10-25', '2018-11-06', 0.1010, 0.60, 0.20, 0.25, '沪深300指数收益率×55%+中债总指数(财富)收益率×45%', 0);
INSERT INTO `fas_fund_basis` VALUES (28, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001427', '招商丰泽灵活配置混合型证券投资基金', '招商丰泽混合A', '混合型', '灵活', '招商基金', '王刚', 'fund.eastmoney.com/manager/30524321.html', '2015-06-08', '2015-06-11', 2.3940, 0.60, 0.15, 0.00, '中国人民银行公布金融机构人民币一年期存款基准利率+3%(单利年化)', 0);
INSERT INTO `fas_fund_basis` VALUES (29, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '008809', '安信民稳增长混合型证券投资基金', '安信民稳增长混合A', '混合型', '偏债', '安信基金', '张翼飞、黄琬舒', 'fund.eastmoney.com/manager/30283265.html', '2020-01-09', '2020-01-14', 49.8550, 0.80, 0.15, 0.00, '沪深300指数收益率×60%+恒生指数收益率×5%+中债综合指数收益率×35%', 0);
INSERT INTO `fas_fund_basis` VALUES (30, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '011892', '易方达先锋成长混合型证券投资基金', '易方达先锋成长混合C', '混合型', '偏股', '易方达基金', '武阳', 'fund.eastmoney.com/manager/30359246.html', '2021-09-01', '2021-09-23', 5.7060, 1.50, 0.25, 0.40, '中证500指数收益率*65%+中证港股通综合指数收益率*20%+中债总指数收益率*15%', 0);
INSERT INTO `fas_fund_basis` VALUES (31, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '012702', '安信民安回报一年持有期混合型证券投资基金', '安信民安回报一年持有混合C', '混合型', '偏债', '安信基金', '张翼飞、李君', 'fund.eastmoney.com/manager/30283265.html', '2021-08-16', '2021-09-07', 7.9060, 0.50, 0.15, 0.01, '中债综合(全价)指数收益率*85%+沪深300指数收益率*10%+恒生指数收益率(经汇率调整后)*5%', 0);
INSERT INTO `fas_fund_basis` VALUES (32, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002017', '招商瑞丰灵活配置混合型发起式证券投资基金', '招商瑞丰灵活配置混合发起式C', '混合型', '灵活', '招商基金', '王刚', 'fund.eastmoney.com/manager/30524321.html', '2013-10-14', '2015-11-18', 0.0000, 0.60, 0.15, 0.50, '60%×沪深300指数收益率+40%×中债综合指数收益率', 0);
INSERT INTO `fas_fund_basis` VALUES (33, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '000535', '长盛航天海工装备灵活配置混合型证券投资基金', '长盛航天海工装备灵活配置混合', '混合型', '灵活', '长盛基金', '王宁', 'fund.eastmoney.com/manager/30040407.html', '2014-02-17', '2014-03-11', 7.4130, 1.50, 0.25, 0.00, '50%*巨潮航天军工指数收益率+50%*中证综合债指数收益率', 0);
INSERT INTO `fas_fund_basis` VALUES (34, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009100', '安信稳健增利混合型证券投资基金', '安信稳健增利混合A', '混合型', '偏债', '安信基金', '张翼飞、李君', 'fund.eastmoney.com/manager/30283265.html', '2020-03-18', '2020-04-01', 11.6660, 0.80, 0.20, 0.00, '沪深300指数收益率×15%+恒生指数收益率×10%+中债综合指数收益率×75%', 0);
INSERT INTO `fas_fund_basis` VALUES (35, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002776', '招商安荣灵活配置混合型证券投资基金', '招商安荣混合A', '混合型', '灵活', '招商基金', '王刚', 'fund.eastmoney.com/manager/30524321.html', '2016-07-11', '2016-07-15', 19.8300, 0.60, 0.10, 0.00, '50%沪深300指数收益率+50%中债综合指数收益率', 0);
INSERT INTO `fas_fund_basis` VALUES (36, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '006700', '红土创新稳健混合型证券投资基金', '红土创新稳健混合A', '混合型', '偏债', '红土创新基金', '陈若劲、杨一', 'fund.eastmoney.com/manager/30047073.html', '2018-12-12', '2019-03-13', 5.1310, 1.00, 0.25, 0.00, '沪深300指数收益率*30%+中证全债指数收益率*70%', 0);
INSERT INTO `fas_fund_basis` VALUES (37, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '008810', '安信民稳增长混合型证券投资基金', '安信民稳增长混合C', '混合型', '偏债', '安信基金', '张翼飞、黄琬舒', 'fund.eastmoney.com/manager/30283265.html', '2020-01-09', '2020-01-14', 49.8550, 0.80, 0.15, 0.40, '沪深300指数收益率×60%+恒生指数收益率×5%+中债综合指数收益率×35%', 0);
INSERT INTO `fas_fund_basis` VALUES (38, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '200015', '长城优化升级混合型证券投资基金', '长城优化升级混合A', '混合型', '偏股', '长城基金', '周诗博', 'fund.eastmoney.com/manager/30722830.html', '2012-03-19', '2012-04-20', 5.2330, 1.50, 0.25, 0.00, '沪深300指数收益率*80%+中债综合财富指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (39, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '012953', '华泰柏瑞恒利混合型证券投资基金', '华泰柏瑞恒利混合A', '混合型', '偏债', '华泰柏瑞基金', '何子建、董辰', 'fund.eastmoney.com/manager/30658325.html', '2021-09-06', '2021-09-14', 2.4000, 0.60, 0.10, 0.00, '上证国债指数收益率*80%+沪深300指数收益率*15%+中证港股通综合指数(人民币)收益率*5%', 0);
INSERT INTO `fas_fund_basis` VALUES (40, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001438', '易方达瑞享灵活配置混合型证券投资基金', '易方达瑞享混合E', '混合型', '灵活', '易方达基金', '武阳', 'fund.eastmoney.com/manager/30359246.html', '2015-06-24', '2015-06-26', 2.1380, 0.80, 0.15, 0.20, '一年期人民币定期存款利率(税后)+2%', 0);
INSERT INTO `fas_fund_basis` VALUES (41, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '011997', '景顺长城安盈回报一年持有期混合型证券投资基金', '景顺长城安盈回报一年持有混合A', '混合型', '偏债', '景顺长城基金', '毛从容、邹立虎', 'fund.eastmoney.com/manager/30040332.html', '2021-05-06', '2021-05-25', 5.2910, 0.70, 0.20, 0.00, '中证综合债指数收益率*80%+沪深300指数收益率*15%+恒生指数收益率(使用估值汇率折算)*5%', 0);
INSERT INTO `fas_fund_basis` VALUES (42, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009124', '华泰保兴科荣混合型证券投资基金', '华泰保兴科荣混合A', '混合型', '偏债', '华泰保兴', '赵旭照、周咏梅', 'fund.eastmoney.com/manager/30567680.html', '2020-03-23', '2020-05-11', 4.8520, 0.60, 0.10, 0.00, '沪深300指数收益率*20%+中债总指数(全价)收益率*80%', 0);
INSERT INTO `fas_fund_basis` VALUES (43, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '005679', '财通资管鑫盛6个月定期开放混合型证券投资基金', '财通资管鑫盛6个月定开', '混合型', '偏债', '财通资管', '李杰', 'fund.eastmoney.com/manager/30170849.html', '2018-04-20', '2018-05-22', 2.5160, 1.00, 0.15, 0.00, '沪深300指数收益率×30%+中债综合指数收益率×70%', 0);
INSERT INTO `fas_fund_basis` VALUES (44, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002777', '招商安荣灵活配置混合型证券投资基金', '招商安荣混合C', '混合型', '灵活', '招商基金', '王刚', 'fund.eastmoney.com/manager/30524321.html', '2016-07-11', '2016-07-15', 19.8300, 0.60, 0.10, 0.80, '50%沪深300指数收益率+50%中债综合指数收益率', 0);
INSERT INTO `fas_fund_basis` VALUES (45, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '008893', '创金合信鑫利混合型证券投资基金', '创金合信鑫利混合A', '混合型', '偏债', '创金合信基金', '闫一帆、王一兵', 'fund.eastmoney.com/manager/30493607.html', '2020-01-13', '2020-01-17', 2.0050, 0.40, 0.10, 0.00, '中债综合指数收益率×80%+沪深300指数收益率×20%', 0);
INSERT INTO `fas_fund_basis` VALUES (46, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009849', '安信稳健聚申一年持有期混合型证券投资基金', '安信稳健聚申一年持有期混合A', '混合型', '偏债', '安信基金', '张翼飞', 'fund.eastmoney.com/manager/30283265.html', '2020-07-30', '2020-09-30', 2.6460, 0.80, 0.20, 0.00, '沪深300指数收益率*15%+恒生指数收益率*10%+中债综合指数收益率*75%', 0);
INSERT INTO `fas_fund_basis` VALUES (47, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002049', '融通新机遇灵活配置混合型证券投资基金', '融通新机遇灵活配置混合', '混合型', '灵活', '融通基金', '余志勇、刘明', 'fund.eastmoney.com/manager/30181575.html', '2015-11-16', '2015-11-17', 2.0010, 0.60, 0.20, 0.00, '沪深300指数收益率×50%+中债综合全价(总值)指数收益率×50%', 0);
INSERT INTO `fas_fund_basis` VALUES (48, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '007163', '浦银安盛环保新能源混合型证券投资基金', '浦银安盛环保新能源A', '混合型', '偏股', '浦银安盛基金', '杨达伟', 'fund.eastmoney.com/manager/30742695.html', '2019-05-16', '2019-07-09', 2.8030, 1.50, 0.25, 0.00, '中证内地低碳经济主题指数收益率*80%+中证全债指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (49, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '206002', '鹏华精选成长混合型证券投资基金', '鹏华精选成长混合A', '混合型', '偏股', '鹏华基金', '朱睿', 'fund.eastmoney.com/manager/30665213.html', '2009-08-04', '2009-09-09', 30.1460, 1.50, 0.25, 0.00, '沪深300指数收益率*80%+中证综合债指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (50, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '003592', '华泰柏瑞享利灵活配置混合型证券投资基金', '华泰柏瑞享利混合C', '混合型', '灵活', '华泰柏瑞基金', '郑青、董辰', 'fund.eastmoney.com/manager/30176370.html', '2016-12-21', '2016-12-29', 2.0000, 0.60, 0.15, 0.25, '沪深300指数收益率×50%+中债综合指数收益率×50%', 0);
INSERT INTO `fas_fund_basis` VALUES (51, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009125', '华泰保兴科荣混合型证券投资基金', '华泰保兴科荣混合C', '混合型', '偏债', '华泰保兴', '赵旭照、周咏梅', 'fund.eastmoney.com/manager/30567680.html', '2020-03-23', '2020-05-11', 4.8520, 0.60, 0.10, 0.10, '沪深300指数收益率*20%+中债总指数(全价)收益率*80%', 0);
INSERT INTO `fas_fund_basis` VALUES (52, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001446', '招商丰泽灵活配置混合型证券投资基金', '招商丰泽混合C', '混合型', '灵活', '招商基金', '王刚', 'fund.eastmoney.com/manager/30524321.html', '2015-06-08', '2015-06-11', 2.3940, 0.60, 0.15, 0.50, '中国人民银行公布金融机构人民币一年期存款基准利率+3%(单利年化)', 0);
INSERT INTO `fas_fund_basis` VALUES (53, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '012954', '华泰柏瑞恒利混合型证券投资基金', '华泰柏瑞恒利混合C', '混合型', '偏债', '华泰柏瑞基金', '何子建、董辰', 'fund.eastmoney.com/manager/30658325.html', '2021-09-06', '2021-09-14', 2.4000, 0.60, 0.10, 0.20, '上证国债指数收益率*80%+沪深300指数收益率*15%+中证港股通综合指数(人民币)收益率*5%', 0);
INSERT INTO `fas_fund_basis` VALUES (54, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '011998', '景顺长城安盈回报一年持有期混合型证券投资基金', '景顺长城安盈回报一年持有混合C', '混合型', '偏债', '景顺长城基金', '毛从容、邹立虎', 'fund.eastmoney.com/manager/30040332.html', '2021-05-06', '2021-05-25', 5.2910, 0.70, 0.20, 0.40, '中证综合债指数收益率*80%+沪深300指数收益率*15%+恒生指数收益率(使用估值汇率折算)*5%', 0);
INSERT INTO `fas_fund_basis` VALUES (55, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '008894', '创金合信鑫利混合型证券投资基金', '创金合信鑫利混合C', '混合型', '偏债', '创金合信基金', '闫一帆、王一兵', 'fund.eastmoney.com/manager/30493607.html', '2020-01-13', '2020-01-17', 2.0050, 0.40, 0.10, 0.20, '中债综合指数收益率×80%+沪深300指数收益率×20%', 0);
INSERT INTO `fas_fund_basis` VALUES (56, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '010605', '创金合信鑫祥混合型证券投资基金', '创金合信鑫祥混合A', '混合型', '偏债', '创金合信基金', '黄弢、闫一帆', 'fund.eastmoney.com/manager/30060759.html', '2020-11-10', '2021-02-04', 2.0670, 0.80, 0.10, 0.00, '沪深300指数收益率×20%+中债综合指数收益率×80%', 0);
INSERT INTO `fas_fund_basis` VALUES (57, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '007164', '浦银安盛环保新能源混合型证券投资基金', '浦银安盛环保新能源C', '混合型', '偏股', '浦银安盛基金', '杨达伟', 'fund.eastmoney.com/manager/30742695.html', '2019-05-16', '2019-07-09', 2.8030, 1.50, 0.25, 0.35, '中证内地低碳经济主题指数收益率*80%+中证全债指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (58, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '003697', '华夏睿磐泰盛混合型证券投资基金', '华夏睿磐泰盛混合', '混合型', '偏债', '华夏基金', '董阳阳、毛颖', 'fund.eastmoney.com/manager/30198442.html', '2017-02-13', '2017-03-15', 6.7820, 0.80, 0.20, 0.00, '中证800指数收益率×15%+上证国债指数收益率×85%', 0);
INSERT INTO `fas_fund_basis` VALUES (59, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '013274', '长城优化升级混合型证券投资基金', '长城优化升级混合C', '混合型', '偏股', '长城基金', '周诗博', 'fund.eastmoney.com/manager/30722830.html', '2021-08-11', '2021-08-11', 0.0000, 1.50, 0.25, 0.60, '沪深300指数收益率*80%+中债综合财富指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (60, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '210002', '金鹰红利价值灵活配置混合型证券投资基金', '金鹰红利价值混合A', '混合型', '灵活', '金鹰基金', '陈颖、朱丹', 'fund.eastmoney.com/manager/30353488.html', '2008-10-08', '2008-12-04', 3.6700, 1.50, 0.25, 0.00, '中证红利指数收益率*60%+上证国债指数收益率*40%', 0);
INSERT INTO `fas_fund_basis` VALUES (61, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '000574', '宝盈新价值灵活配置混合型证券投资基金', '宝盈新价值混合A', '混合型', '灵活', '宝盈基金', '杨思亮', 'fund.eastmoney.com/manager/30570996.html', '2014-03-31', '2014-04-10', 4.3390, 1.50, 0.25, 0.00, '沪深300指数收益率×65%+中债综合指数收益率×35%', 0);
INSERT INTO `fas_fund_basis` VALUES (62, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002091', '华泰柏瑞新利灵活配置混合型证券投资基金', '华泰柏瑞新利混合C', '混合型', '灵活', '华泰柏瑞基金', '郑青、董辰', 'fund.eastmoney.com/manager/30176370.html', '2015-11-18', '2015-11-19', 0.0000, 0.80, 0.25, 0.20, '一年期银行定期存款利率(税后)+1%', 0);
INSERT INTO `fas_fund_basis` VALUES (63, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009493', '大成尊享18个月定期开放混合型证券投资基金', '大成尊享18月定开混合A', '混合型', '偏债', '大成基金', '孙丹、徐雄晖', 'fund.eastmoney.com/manager/30532044.html', '2020-08-24', '2020-09-23', 2.2560, 0.80, 0.20, 0.00, '沪深300指数收益率*15%+恒生指数收益率*5%+中债综合全价指数收益率*80%', 0);
INSERT INTO `fas_fund_basis` VALUES (64, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '008905', '嘉合锦鹏添利混合型证券投资基金', '嘉合锦鹏添利混合A', '混合型', '偏债', '嘉合基金', '于启明、季慧娟', 'fund.eastmoney.com/manager/30176648.html', '2020-04-13', '2020-04-29', 6.7020, 0.80, 0.20, 0.00, '中证全债指数收益率*80%+沪深300指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (65, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '010606', '创金合信鑫祥混合型证券投资基金', '创金合信鑫祥混合C', '混合型', '偏债', '创金合信基金', '黄弢、闫一帆', 'fund.eastmoney.com/manager/30060759.html', '2020-11-10', '2021-02-04', 2.0670, 0.80, 0.10, 0.40, '沪深300指数收益率×20%+中债综合指数收益率×80%', 0);
INSERT INTO `fas_fund_basis` VALUES (66, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001743', '诺安优选回报灵活配置混合型证券投资基金', '诺安优选回报混合', '混合型', '灵活', '诺安基金', '张堃', 'fund.eastmoney.com/manager/30365048.html', '2016-08-29', '2016-09-22', 10.3420, 1.20, 0.10, 0.00, '沪深300指数收益率×60%+中证全债指数×40%', 0);
INSERT INTO `fas_fund_basis` VALUES (67, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '005686', '财通资管瑞享12个月定期开放混合型证券投资基金', '财通资管瑞享12个月定开混合A', '混合型', '偏债', '财通资管', '顾宇笛、周庆', 'fund.eastmoney.com/manager/30551982.html', '2018-04-26', '2018-05-29', 4.7610, 1.00, 0.25, 0.80, '沪深300指数收益率*10%+中债综合指数收益率*90%', 0);
INSERT INTO `fas_fund_basis` VALUES (68, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002819', '招商丰美灵活配置混合型证券投资基金', '招商丰美混合A', '混合型', '灵活', '招商基金', '王刚', 'fund.eastmoney.com/manager/30524321.html', '2016-11-07', '2016-11-10', 2.0000, 0.60, 0.15, 0.00, '沪深300指数收益率*50%+中证全债指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (69, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '013711', '广发再融资主题灵活配置混合型证券投资基金(LOF)', '广发再融资主题(LOF)C', '混合型', '灵活', '广发基金', '田文舟', 'fund.eastmoney.com/manager/30672366.html', '2016-11-07', '2021-09-23', 0.0000, 0.60, 0.20, 0.10, '中证800指数收益率*55%+中证全债指数收益率*45%', 0);
INSERT INTO `fas_fund_basis` VALUES (70, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '004010', '华泰柏瑞鼎利灵活配置混合型证券投资基金', '华泰柏瑞鼎利灵活配置混合A', '混合型', '灵活', '华泰柏瑞基金', '郑青、董辰', 'fund.eastmoney.com/manager/30176370.html', '2016-12-15', '2016-12-22', 2.0000, 0.60, 0.15, 0.00, '沪深300指数收益率×50%+中债综合指数收益率×50%', 0);
INSERT INTO `fas_fund_basis` VALUES (71, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '000743', '红塔红土盛世普益灵活配置混合型发起式证券投资基金', '红塔红土盛世普益混合发起式', '混合型', '灵活', '红塔红土', '吴秋松', 'fund.eastmoney.com/manager/30726214.html', '2014-08-18', '2014-09-18', 1.4900, 0.60, 0.20, 0.00, '沪深300指数×55%+中债总指数(财富)×45%', 0);
INSERT INTO `fas_fund_basis` VALUES (72, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '217002', '招商安泰平衡型证券投资基金', '招商安泰平衡混合', '混合型', '平衡', '招商基金', '李崟', 'fund.eastmoney.com/manager/30425907.html', '2003-03-17', '2003-04-28', 8.9940, 1.50, 0.25, 0.00, '中证国债指数收益率*50%+上证180指数收益率*45%+同业存款利率*5%', 0);
INSERT INTO `fas_fund_basis` VALUES (73, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '012449', '广发睿毅领先混合型证券投资基金', '广发睿毅领先混合C', '混合型', '偏股', '广发基金', '林英睿', 'fund.eastmoney.com/manager/30137559.html', '2017-11-13', '2021-06-01', 0.0000, 1.50, 0.25, 0.40, '沪深300指数收益率*75%+中证全债指数收益率*25%', 0);
INSERT INTO `fas_fund_basis` VALUES (74, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '009494', '大成尊享18个月定期开放混合型证券投资基金', '大成尊享18月定开混合C', '混合型', '偏债', '大成基金', '孙丹、徐雄晖', 'fund.eastmoney.com/manager/30532044.html', '2020-08-24', '2020-09-23', 2.2560, 0.80, 0.20, 0.60, '沪深300指数收益率*15%+恒生指数收益率*5%+中债综合全价指数收益率*80%', 0);
INSERT INTO `fas_fund_basis` VALUES (75, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002418', '汇添富优选回报灵活配置混合型证券投资基金', '汇添富优选回报灵活配置混合C', '混合型', '灵活', '汇添富基金', '赖中立、李威', 'fund.eastmoney.com/manager/30195060.html', '2013-01-15', '2016-02-03', 0.0000, 0.90, 0.25, 0.40, '沪深300指数收益率*50%+中债综合指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (76, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '010944', '招商商业模式优选混合型证券投资基金', '招商商业模式优选A', '混合型', '偏股', '招商基金', '王奇玮', 'fund.eastmoney.com/manager/30131012.html', '2021-03-10', '2021-03-26', 2.5530, 1.50, 0.25, 0.00, '中证500指数收益率*60%+恒生指数收益率(使用估值汇率折算)*10%+中债综合(全价)指数收益率*30%', 0);
INSERT INTO `fas_fund_basis` VALUES (77, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '005851', '财通新视野灵活配置混合型证券投资基金', '财通新视野灵活配置混合A', '混合型', '灵活', '财通基金', '沈犁', 'fund.eastmoney.com/manager/30724468.html', '2018-05-21', '2018-06-25', 12.3070, 1.50, 0.25, 0.00, '沪深300指数收益率×55%+上证国债指数收益率 ×45%', 0);
INSERT INTO `fas_fund_basis` VALUES (78, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001763', '广发多策略灵活配置混合型证券投资基金', '广发多策略混合', '混合型', '灵活', '广发基金', '林英睿', 'fund.eastmoney.com/manager/30137559.html', '2015-11-09', '2015-12-09', 56.1360, 1.50, 0.25, 0.00, '50%×沪深300指数+50%×中证全债指数', 0);
INSERT INTO `fas_fund_basis` VALUES (79, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '501015', '财通多策略升级混合型证券投资基金(LOF)', '财通多策略升级混合(LOF)A', '混合型', '灵活', '财通基金', '沈犁', 'fund.eastmoney.com/manager/30724468.html', '2016-02-18', '2016-03-09', 46.4690, 1.50, 0.25, 0.00, '沪深300指数收益率*55%+上证国债指数收益率*45%', 0);
INSERT INTO `fas_fund_basis` VALUES (80, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '004011', '华泰柏瑞鼎利灵活配置混合型证券投资基金', '华泰柏瑞鼎利灵活配置混合C', '混合型', '灵活', '华泰柏瑞基金', '郑青、董辰', 'fund.eastmoney.com/manager/30176370.html', '2016-12-15', '2016-12-22', 2.0000, 0.60, 0.15, 0.25, '沪深300指数收益率×50%+中债综合指数收益率×50%', 0);
INSERT INTO `fas_fund_basis` VALUES (81, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '000772', '景顺长城中国回报灵活配置混合型证券投资基金', '景顺长城中国回报灵活配置混合', '混合型', '灵活', '景顺长城基金', '韩文强', 'fund.eastmoney.com/manager/30683404.html', '2014-09-30', '2014-11-06', 28.7060, 1.50, 0.25, 0.00, '1年期银行定期存款利率(税后)+3%(单利年化)', 0);
INSERT INTO `fas_fund_basis` VALUES (82, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002820', '招商丰美灵活配置混合型证券投资基金', '招商丰美混合C', '混合型', '灵活', '招商基金', '王刚', 'fund.eastmoney.com/manager/30524321.html', '2016-11-07', '2016-11-10', 2.0000, 0.60, 0.15, 0.20, '沪深300指数收益率*50%+中证全债指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (83, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '240004', '华宝动力组合混合型证券投资基金', '华宝动力组合混合A', '混合型', '偏股', '华宝基金', '刘自强', 'fund.eastmoney.com/manager/30043465.html', '2005-09-27', '2005-11-17', 5.3540, 1.50, 0.25, 0.00, '上证180指数收益率与深证100指数收益率的流通市值加权平均*80%+上证国债指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (84, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '005903', '泰达宏利绩优增长灵活配置混合型证券投资基金', '泰达宏利绩优混合A', '混合型', '灵活', '泰达宏利基金', '张勋、孙硕', 'fund.eastmoney.com/manager/30304973.html', '2018-05-14', '2018-06-13', 2.2130, 1.50, 0.25, 0.00, '中证全指指数收益率*50%+中证综合债券指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (85, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '011442', '创金合信鑫瑞混合型证券投资基金', '创金合信鑫瑞混合A', '混合型', '偏债', '创金合信基金', '王一兵', 'fund.eastmoney.com/manager/30056585.html', '2021-02-05', '2021-04-26', 2.0540, 0.80, 0.10, 0.00, '沪深300指数收益率*20%+中债综合指数收益率*80%', 0);
INSERT INTO `fas_fund_basis` VALUES (86, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001816', '汇添富新睿精选灵活配置混合型证券投资基金', '汇添富新睿精选混合A', '混合型', '灵活', '汇添富基金', '董超', 'fund.eastmoney.com/manager/30705026.html', '2016-11-28', '2016-12-21', 8.7220, 0.90, 0.25, 0.00, '沪深300指数收益率*50%+中债综合指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (87, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '012609', '安信稳健汇利一年持有期混合型证券投资基金', '安信稳健汇利一年持有混合A', '混合型', '偏债', '安信基金', '张翼飞、李君', 'fund.eastmoney.com/manager/30283265.html', '2021-07-26', '2021-08-10', 20.8440, 0.80, 0.20, 0.00, '中证800指数收益率×15%+恒生指数收益率(经汇率调整)×5%+中债总指数(全价)收益率×80%', 0);
INSERT INTO `fas_fund_basis` VALUES (88, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '519019', '大成景阳领先混合型证券投资基金', '大成景阳领先混合', '混合型', '偏股', '大成基金', '齐炜中', 'fund.eastmoney.com/manager/30691494.html', '2007-12-17', '2007-12-11', 10.0000, 1.50, 0.25, 0.00, '沪深300指数*80%+中债综合指数*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (89, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002420', '汇添富盈鑫灵活配置混合型证券投资基金', '汇添富盈鑫混合A', '混合型', '灵活', '汇添富基金', '刘昇', 'fund.eastmoney.com/manager/30745787.html', '2016-02-26', '2016-03-11', 48.4950, 1.50, 0.25, 0.00, '沪深300指数收益率*50%+中债综合指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (90, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002910', '易方达供给改革灵活配置混合型证券投资基金', '易方达供给改革混合', '混合型', '灵活', '易方达基金', '杨宗昌', 'fund.eastmoney.com/manager/30665624.html', '2016-12-02', '2017-01-25', 2.5400, 1.50, 0.25, 0.00, '沪深300指数收益率×65%+中债新综合财富指数收益率×35%', 0);
INSERT INTO `fas_fund_basis` VALUES (91, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '519185', '万家精选混合型证券投资基金', '万家精选混合A', '混合型', '偏股', '万家基金', '黄海', 'fund.eastmoney.com/manager/30050327.html', '2009-04-13', '2009-05-18', 16.4010, 1.50, 0.25, 0.00, '沪深300指数收益率*80%+上证国债指数收益率*20%', 0);
INSERT INTO `fas_fund_basis` VALUES (92, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '002449', '民生加银量化中国灵活配置混合型证券投资基金', '民生加银量化中国混合', '混合型', '灵活', '民生加银基金', '蔡晓、刘昊', 'fund.eastmoney.com/manager/30439357.html', '2016-04-13', '2016-05-19', 2.4780, 0.60, 0.10, 0.00, '沪深300指数收益率×60%+中证国债指数收益率×40%', 0);
INSERT INTO `fas_fund_basis` VALUES (93, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '004253', '国泰黄金交易型开放式证券投资基金联接基金', '国泰黄金ETF联接C', '商品（不含QDII）', '', '国泰基金', '艾小军', 'fund.eastmoney.com/manager/30277862.html', '2016-04-05', '2017-05-02', 0.0000, 0.50, 0.10, 0.35, '上海黄金交易所挂盘交易的Au99.99合约收益率×95%+银行活期存款税后收益率×5%', 0);
INSERT INTO `fas_fund_basis` VALUES (94, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '007385', '华泰保兴安盈三个月定期开放混合型发起式证券投资基金', '华泰保兴安盈定开混合', '混合型', '偏债', '华泰保兴', '赵旭照、周咏梅', 'fund.eastmoney.com/manager/30567680.html', '2019-04-29', '2019-05-06', 1.1010, 0.40, 0.05, 0.00, '沪深300指数收益率*10%+中债总指数(全价)收益率*90%', 0);
INSERT INTO `fas_fund_basis` VALUES (95, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '519191', '万家新利灵活配置混合型证券投资基金', '万家新利灵活配置混合', '混合型', '灵活', '万家基金', '黄海', 'fund.eastmoney.com/manager/30050327.html', '2013-12-26', '2014-01-24', 4.3490, 1.50, 0.25, 0.00, '沪深300指数收益率*50%+中证全债指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (96, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '519198', '万家颐和灵活配置混合型证券投资基金', '万家颐和灵活配置混合A', '混合型', '灵活', '万家基金', '章恒', 'fund.eastmoney.com/manager/30302523.html', '2016-05-23', '2016-06-23', 8.7860, 1.50, 0.20, 0.00, '沪深300指数收益率*50%+上证国债指数收益率*50%', 0);
INSERT INTO `fas_fund_basis` VALUES (97, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '005959', '财通新视野灵活配置混合型证券投资基金', '财通新视野灵活配置混合C', '混合型', '灵活', '财通基金', '沈犁', 'fund.eastmoney.com/manager/30724468.html', '2018-05-21', '2018-06-25', 12.3070, 1.50, 0.25, 0.80, '沪深300指数收益率×55%+上证国债指数收益率 ×45%', 0);
INSERT INTO `fas_fund_basis` VALUES (98, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '007781', '天弘弘新混合型发起式证券投资基金', '天弘弘新混合发起式A', '混合型', '偏债', '天弘基金', '杜广', 'fund.eastmoney.com/manager/30686324.html', '2019-08-20', '2019-08-21', 0.1000, 0.60, 0.10, 0.00, '沪深300指数收益率*15%+中证全债指数收益率*85%', 0);
INSERT INTO `fas_fund_basis` VALUES (99, '2022-09-27 17:16:51', '2022-09-27 17:16:51', NULL, '001076', '易方达改革红利混合型证券投资基金', '易方达改革红利混合', '混合型', '偏股', '易方达基金', '陈皓', 'fund.eastmoney.com/manager/30189737.html', '2015-03-30', '2015-04-23', 21.9930, 1.50, 0.25, 0.00, '沪深300指数收益率×70%+一年期人民币定期存款利率(税后)×30%', 0);
COMMIT;

-- ----------------------------
-- Table structure for fas_fund_day_top
-- ----------------------------
DROP TABLE IF EXISTS `fas_fund_day_top`;
CREATE TABLE `fas_fund_day_top` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  `updated_at` datetime DEFAULT NULL COMMENT '更新时间',
  `deleted_at` datetime DEFAULT NULL COMMENT '删除时间',
  `fund_code` varchar(10) NOT NULL DEFAULT '' COMMENT '基金code',
  `fund_name` varchar(50) DEFAULT NULL COMMENT '基金名称',
  `top_date` varchar(12) DEFAULT NULL COMMENT '排名日期',
  `net_worth` decimal(10,4) DEFAULT NULL COMMENT '单位净值',
  `day_change` decimal(10,4) DEFAULT NULL COMMENT '日增长率(百分比)',
  `week_change` decimal(10,4) DEFAULT NULL COMMENT '近一周(百分比)',
  `mouth_change` decimal(10,4) DEFAULT NULL COMMENT '近一月(百分比)',
  `three_mouth_change` decimal(10,4) DEFAULT NULL COMMENT '近3个月(百分比)',
  `six_mouth_change` decimal(10,4) DEFAULT NULL COMMENT '近6个月(百分比)',
  `year_change` decimal(10,4) DEFAULT NULL COMMENT '近1年(百分比)',
  `two_year_change` decimal(10,4) DEFAULT NULL COMMENT '近2年(百分比)',
  `three_year_change` decimal(10,4) DEFAULT NULL COMMENT '近2年(百分比)',
  `current_change` decimal(10,4) DEFAULT NULL COMMENT '今年来(百分比)',
  `create_change` decimal(10,4) DEFAULT NULL COMMENT '成立以来(百分比)',
  PRIMARY KEY (`id`),
  KEY `idx_fas_fund_day_top_top_date` (`top_date`),
  KEY `idx_fas_fund_day_top_deleted_at` (`deleted_at`),
  KEY `idx_fas_fund_day_top_fund_code` (`fund_code`),
  KEY `idx_fas_fund_day_top_fund_name` (`fund_name`)
) ENGINE=InnoDB AUTO_INCREMENT=301 DEFAULT CHARSET=utf8mb3 COMMENT='基金每日排行';

-- ----------------------------
-- Records of fas_fund_day_top
-- ----------------------------
BEGIN;
INSERT INTO `fas_fund_day_top` VALUES (201, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '519212', '万家宏观择时多策略混合', '2022-09-26', 2.1284, -2.7500, -0.3700, 0.0400, 16.9300, 31.4200, 57.2500, 40.1700, 82.2700, 65.0800, 112.8400);
INSERT INTO `fas_fund_day_top` VALUES (202, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '519191', '万家新利灵活配置混合', '2022-09-26', 1.6952, -2.7300, -0.5900, -0.0100, 16.5600, 28.7000, 51.9500, 46.8600, 70.2500, 58.9900, 137.1700);
INSERT INTO `fas_fund_day_top` VALUES (203, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '519185', '万家精选混合A', '2022-09-26', 1.6166, -2.7000, -0.8000, -0.1100, 15.0100, 24.6900, 45.7300, 40.0000, 53.0300, 50.8400, 277.2400);
INSERT INTO `fas_fund_day_top` VALUES (204, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '007937', '华夏饲料豆粕期货ETF联接A', '2022-09-26', 1.6449, -0.9600, 0.4400, 5.7500, 15.2000, 2.4600, 31.9800, 47.0200, 0.0000, 38.3000, 64.4900);
INSERT INTO `fas_fund_day_top` VALUES (205, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '007938', '华夏饲料豆粕期货ETF联接C', '2022-09-26', 1.6316, -0.9700, 0.4400, 5.7400, 15.1100, 2.3100, 31.5900, 46.1500, 0.0000, 37.9900, 63.1600);
INSERT INTO `fas_fund_day_top` VALUES (206, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002420', '汇添富盈鑫混合A', '2022-09-26', 2.2280, 4.3100, 6.9600, -5.8300, 8.9000, 40.1300, 20.9600, 35.3600, 81.4300, 9.9700, 122.8000);
INSERT INTO `fas_fund_day_top` VALUES (207, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002910', '易方达供给改革混合', '2022-09-26', 2.9922, -0.4000, 1.1500, -6.8500, 10.4000, 26.1000, 20.8400, 93.7300, 253.4800, 20.9700, 199.2200);
INSERT INTO `fas_fund_day_top` VALUES (208, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '519198', '万家颐和灵活配置混合A', '2022-09-26', 1.7074, -3.0600, -1.7000, -5.7000, -0.0300, 11.1400, 19.1800, 59.7400, 114.2100, 25.7800, 141.7200);
INSERT INTO `fas_fund_day_top` VALUES (209, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001832', '易方达瑞恒灵活配置混合', '2022-09-26', 2.7220, -1.3400, -1.1600, -4.5200, 6.3300, 19.1800, 18.6100, 36.9200, 115.5200, 10.0700, 172.2000);
INSERT INTO `fas_fund_day_top` VALUES (210, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '470021', '汇添富优选回报灵活配置混合A', '2022-09-26', 2.4540, 4.8700, 8.9700, -5.3600, 10.6900, 37.0200, 18.4900, 48.3700, 119.3000, 13.0900, 145.4000);
INSERT INTO `fas_fund_day_top` VALUES (211, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002418', '汇添富优选回报灵活配置混合C', '2022-09-26', 2.4280, 4.8800, 8.9800, -5.3800, 10.6200, 36.7900, 17.9800, 47.2400, 116.7900, 12.7200, 142.8000);
INSERT INTO `fas_fund_day_top` VALUES (212, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '501015', '财通多策略升级混合(LOF)A', '2022-09-26', 1.1020, -1.7800, -6.6100, -12.1900, -9.9700, -6.6900, 16.3700, 7.4100, 31.0300, -1.9600, 10.2000);
INSERT INTO `fas_fund_day_top` VALUES (213, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '005851', '财通新视野灵活配置混合A', '2022-09-26', 1.7986, -1.9400, -6.7700, -12.5000, -10.7900, -7.8300, 16.1100, 29.8200, 60.2900, -1.6200, 79.8600);
INSERT INTO `fas_fund_day_top` VALUES (214, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001438', '易方达瑞享混合E', '2022-09-26', 2.4490, 1.4500, -1.0500, 0.9500, 0.3700, 23.0700, 15.8500, 37.8900, 115.0100, 9.0400, 144.9000);
INSERT INTO `fas_fund_day_top` VALUES (215, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '005959', '财通新视野灵活配置混合C', '2022-09-26', 1.7384, -1.9400, -6.7800, -12.5600, -10.9700, -8.2000, 15.1900, 27.7700, 56.4900, -2.1900, 73.8400);
INSERT INTO `fas_fund_day_top` VALUES (216, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '162717', '广发再融资主题(LOF)A', '2022-09-26', 1.6786, 4.6000, 6.4300, 0.1900, 8.9200, 28.5300, 14.5400, 24.4300, 60.6300, 12.1500, 67.8600);
INSERT INTO `fas_fund_day_top` VALUES (217, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001743', '诺安优选回报混合', '2022-09-26', 1.7320, -0.3500, -2.8100, -5.3000, 4.7200, 8.5200, 14.4700, 64.1700, 69.1000, -6.0700, 115.7800);
INSERT INTO `fas_fund_day_top` VALUES (218, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '013711', '广发再融资主题(LOF)C', '2022-09-26', 1.6777, 4.5900, 6.4200, 0.1900, 8.8400, 28.4600, 14.4700, 0.0000, 0.0000, 12.0900, 14.5300);
INSERT INTO `fas_fund_day_top` VALUES (219, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '000772', '景顺长城中国回报灵活配置混合', '2022-09-26', 2.1140, 0.0500, -2.7200, 5.7000, 10.2200, 11.0900, 13.2300, 16.9200, 70.6200, 6.6600, 111.4000);
INSERT INTO `fas_fund_day_top` VALUES (220, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '008809', '安信民稳增长混合A', '2022-09-26', 1.3028, -0.7500, -2.0500, -0.9600, -0.2800, 4.8400, 12.5600, 33.0000, 0.0000, 8.8700, 35.0000);
INSERT INTO `fas_fund_day_top` VALUES (221, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '530005', '建信优化配置混合A', '2022-09-26', 1.7250, -0.3100, -0.3200, -7.0500, 4.4300, 15.7100, 12.4500, 17.4000, 62.2800, 0.4400, 242.6100);
INSERT INTO `fas_fund_day_top` VALUES (222, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '008810', '安信民稳增长混合C', '2022-09-26', 1.2885, -0.7500, -2.0500, -0.9900, -0.3900, 4.6200, 12.1000, 31.9300, 0.0000, 8.5500, 33.5500);
INSERT INTO `fas_fund_day_top` VALUES (223, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '162607', '景顺长城资源垄断混合', '2022-09-26', 0.5800, 0.1700, -2.6800, 4.8800, 7.8100, 8.6100, 11.6500, 11.4500, 64.8800, 4.3400, 796.7800);
INSERT INTO `fas_fund_day_top` VALUES (224, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '003175', '华泰柏瑞多策略混合A', '2022-09-26', 2.0477, -1.7800, -0.5900, 0.1500, 6.3600, 10.4400, 11.2600, 60.7900, 73.5200, 9.4700, 104.7700);
INSERT INTO `fas_fund_day_top` VALUES (225, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '004475', '华泰柏瑞富利混合A', '2022-09-26', 1.8491, -1.7800, -0.5100, 0.4200, 6.6300, 10.7600, 11.0200, 89.3800, 112.2000, 8.9100, 84.9100);
INSERT INTO `fas_fund_day_top` VALUES (226, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '000743', '红塔红土盛世普益混合发起式', '2022-09-26', 1.1789, 0.2900, 0.1000, -1.2300, -1.7300, 3.9700, 10.9400, 34.0100, 85.3500, 4.8800, 109.9200);
INSERT INTO `fas_fund_day_top` VALUES (227, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009499', '景顺长城安鑫回报混合A', '2022-09-26', 1.1571, 0.2500, -0.3000, 3.9200, 5.7400, 4.9500, 10.1400, 15.5400, 0.0000, 7.3100, 15.7200);
INSERT INTO `fas_fund_day_top` VALUES (228, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '007781', '天弘弘新混合发起式A', '2022-09-26', 1.3268, -0.0800, 0.5500, 0.2200, 3.7800, 6.8000, 9.8000, 15.0600, 32.5900, 1.4800, 32.6800);
INSERT INTO `fas_fund_day_top` VALUES (229, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009755', '景顺长城安鑫回报混合C', '2022-09-26', 1.1469, 0.2400, -0.3000, 3.8900, 5.6300, 4.7500, 9.7000, 14.6200, 0.0000, 7.0000, 14.7000);
INSERT INTO `fas_fund_day_top` VALUES (230, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009849', '安信稳健聚申一年持有期混合A', '2022-09-26', 1.1586, -0.5800, -1.6100, -0.7200, 0.0500, 3.6700, 9.0500, 0.0000, 0.0000, 6.6000, 23.5400);
INSERT INTO `fas_fund_day_top` VALUES (231, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002662', '前海开源沪港深大消费混合A', '2022-09-26', 1.9330, 0.2600, -2.0800, -7.5100, -7.4700, -3.7400, 9.0200, 22.1100, 71.8200, -0.9200, 93.3000);
INSERT INTO `fas_fund_day_top` VALUES (232, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002663', '前海开源沪港深大消费混合C', '2022-09-26', 1.9150, 0.2100, -2.1000, -7.5800, -7.5300, -3.8200, 8.8700, 21.8200, 71.2900, -1.0300, 91.5000);
INSERT INTO `fas_fund_day_top` VALUES (233, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '003697', '华夏睿磐泰盛混合', '2022-09-26', 1.3094, 0.0500, -0.1500, -1.6200, 3.8400, 9.5000, 8.7100, 14.8100, 21.7800, 3.6200, 30.9400);
INSERT INTO `fas_fund_day_top` VALUES (234, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001076', '易方达改革红利混合', '2022-09-26', 1.8320, 0.0500, -0.1100, -4.5300, 0.1600, 12.5300, 8.4700, 15.4400, 59.0300, -0.6500, 83.2000);
INSERT INTO `fas_fund_day_top` VALUES (235, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001763', '广发多策略混合', '2022-09-26', 1.8300, 0.7200, -1.0300, 0.7700, 0.3800, 4.6300, 8.2800, 39.9100, 100.8800, 2.8100, 83.0000);
INSERT INTO `fas_fund_day_top` VALUES (236, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002776', '招商安荣混合A', '2022-09-26', 1.4788, -0.6600, -0.5100, -1.8500, 1.5600, 7.7800, 8.2100, 21.9300, 41.1600, 1.0600, 53.6500);
INSERT INTO `fas_fund_day_top` VALUES (237, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '210002', '金鹰红利价值混合A', '2022-09-26', 1.8713, -0.1900, -0.2300, -3.5500, -3.4000, 11.4700, 8.0900, 28.6700, 69.8900, -3.2500, 347.5800);
INSERT INTO `fas_fund_day_top` VALUES (238, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '006547', '红塔红土盛弘混合A', '2022-09-26', 1.1530, 0.2300, -0.4300, -6.1000, -5.5000, 2.2700, 8.0400, 23.8200, 61.4900, 3.5900, 77.9100);
INSERT INTO `fas_fund_day_top` VALUES (239, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '007163', '浦银安盛环保新能源A', '2022-09-26', 2.9060, 4.6000, 7.3600, -4.9400, 7.1000, 23.4000, 7.8100, 103.4000, 190.9200, 2.6200, 190.6000);
INSERT INTO `fas_fund_day_top` VALUES (240, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '006548', '红塔红土盛弘混合C', '2022-09-26', 1.1391, 0.2200, -0.4400, -6.1200, -5.5600, 2.1200, 7.7500, 23.1700, 60.2700, 3.3800, 76.2300);
INSERT INTO `fas_fund_day_top` VALUES (241, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '350002', '天治低碳经济混合', '2022-09-26', 1.1302, -0.4800, -1.9900, -5.1100, 2.7600, 16.9900, 7.4800, 38.2200, 63.5100, 1.3500, 310.7700);
INSERT INTO `fas_fund_day_top` VALUES (242, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '007164', '浦银安盛环保新能源C', '2022-09-26', 2.8637, 4.6000, 7.3600, -4.9700, 7.0100, 23.1900, 7.4400, 101.9800, 187.6100, 2.3500, 186.3700);
INSERT INTO `fas_fund_day_top` VALUES (243, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002777', '招商安荣混合C', '2022-09-26', 1.4068, -0.6600, -0.5200, -1.9100, 1.3500, 7.3400, 7.3400, 19.9900, 37.8000, 0.4700, 46.1800);
INSERT INTO `fas_fund_day_top` VALUES (244, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001427', '招商丰泽混合A', '2022-09-26', 1.6680, -0.6600, -0.5400, -1.8800, 1.6500, 6.7900, 7.2000, 20.6900, 35.1700, 0.4800, 66.8000);
INSERT INTO `fas_fund_day_top` VALUES (245, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '240004', '华宝动力组合混合A', '2022-09-26', 2.8849, 0.9900, 0.9600, -7.0300, -5.8800, 3.4900, 7.1500, 39.4400, 116.4400, 2.1100, 0.0000);
INSERT INTO `fas_fund_day_top` VALUES (246, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002449', '民生加银量化中国混合', '2022-09-26', 1.2850, 0.0000, 0.0000, 1.6600, 1.4200, 7.6200, 7.0800, 22.9700, 44.8700, 0.7800, 28.5000);
INSERT INTO `fas_fund_day_top` VALUES (247, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '217002', '招商安泰平衡混合', '2022-09-26', 1.6322, -0.9900, -0.1300, -1.9900, 5.1900, 8.2700, 7.0600, 31.4200, 77.7200, 11.4100, 619.1700);
INSERT INTO `fas_fund_day_top` VALUES (248, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '011891', '易方达先锋成长混合A', '2022-09-26', 1.0706, 2.1500, -1.1300, -1.6900, -2.8100, 21.6200, 7.0500, 0.0000, 0.0000, 5.6400, 7.0600);
INSERT INTO `fas_fund_day_top` VALUES (249, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002820', '招商丰美混合C', '2022-09-26', 1.3790, -0.6500, -0.5100, -1.5000, 1.6200, 6.3200, 6.9500, 22.1400, 39.9500, -0.1500, 64.9800);
INSERT INTO `fas_fund_day_top` VALUES (250, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002819', '招商丰美混合A', '2022-09-26', 1.3760, -0.6500, -0.5100, -1.7800, 1.4000, 6.0900, 6.8700, 22.2800, 40.1800, -0.3600, 66.1700);
INSERT INTO `fas_fund_day_top` VALUES (251, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '005679', '财通资管鑫盛6个月定开', '2022-09-26', 1.3714, -0.1600, -0.2800, -0.6200, 0.8700, 3.3100, 6.8200, 11.6300, 16.1300, 1.6300, 37.1400);
INSERT INTO `fas_fund_day_top` VALUES (252, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '519019', '大成景阳领先混合', '2022-09-26', 0.8910, -0.1100, 0.5600, -0.5600, 5.6900, 17.2400, 6.8100, 43.4800, 123.4900, 2.1100, 122.7200);
INSERT INTO `fas_fund_day_top` VALUES (253, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001446', '招商丰泽混合C', '2022-09-26', 1.6300, -0.6100, -0.5500, -1.8700, 1.5600, 6.6100, 6.6800, 19.5000, 33.6100, 0.1200, 63.0000);
INSERT INTO `fas_fund_day_top` VALUES (254, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '010605', '创金合信鑫祥混合A', '2022-09-26', 1.0601, -0.2100, -0.8600, -0.6700, -0.4900, 2.2000, 6.6500, 0.0000, 0.0000, 0.4800, 6.0100);
INSERT INTO `fas_fund_day_top` VALUES (255, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '011892', '易方达先锋成长混合C', '2022-09-26', 1.0664, 2.1600, -1.1200, -1.7100, -2.9000, 21.3900, 6.6400, 0.0000, 0.0000, 5.3400, 6.6400);
INSERT INTO `fas_fund_day_top` VALUES (256, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '004010', '华泰柏瑞鼎利灵活配置混合A', '2022-09-26', 1.4643, -0.3500, -0.0900, 0.2500, 2.3800, 4.5500, 6.5500, 25.0000, 39.5900, 4.6500, 69.8500);
INSERT INTO `fas_fund_day_top` VALUES (257, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001247', '华泰柏瑞新利混合A', '2022-09-26', 1.4738, -0.3700, -0.0900, 0.2100, 2.3000, 4.5200, 6.4300, 27.0700, 51.1200, 4.7300, 73.4400);
INSERT INTO `fas_fund_day_top` VALUES (258, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '012701', '安信民安回报一年持有混合A', '2022-09-26', 1.0635, -0.2900, -0.8900, -0.1400, 0.4200, 2.8800, 6.3900, 0.0000, 0.0000, 4.8200, 6.3500);
INSERT INTO `fas_fund_day_top` VALUES (259, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '003591', '华泰柏瑞享利混合A', '2022-09-26', 1.3619, -0.3900, -0.1100, 0.3000, 2.5700, 4.3700, 6.3800, 16.1000, 29.7500, 4.4400, 56.1900);
INSERT INTO `fas_fund_day_top` VALUES (260, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '005233', '广发睿毅领先混合A', '2022-09-26', 2.7023, 0.7700, -0.7900, 0.4800, 0.2300, 3.9600, 6.3800, 38.6200, 127.2200, 1.8500, 170.2300);
INSERT INTO `fas_fund_day_top` VALUES (261, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '012702', '安信民安回报一年持有混合C', '2022-09-26', 1.0634, -0.2900, -0.8900, -0.1400, 0.4200, 2.8700, 6.3800, 0.0000, 0.0000, 4.8100, 6.3400);
INSERT INTO `fas_fund_day_top` VALUES (262, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '012953', '华泰柏瑞恒利混合A', '2022-09-26', 1.0523, -0.4800, -0.1800, 0.2300, 2.4600, 4.7800, 6.3400, 0.0000, 0.0000, 4.5300, 5.2300);
INSERT INTO `fas_fund_day_top` VALUES (263, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '004011', '华泰柏瑞鼎利灵活配置混合C', '2022-09-26', 1.4878, -0.3600, -0.0900, 0.2200, 2.3100, 4.4100, 6.2800, 24.2700, 38.4400, 4.4500, 72.2300);
INSERT INTO `fas_fund_day_top` VALUES (264, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002091', '华泰柏瑞新利混合C', '2022-09-26', 1.4643, -0.3700, -0.1000, 0.1900, 2.2500, 4.4200, 6.2200, 26.5600, 50.1600, 4.5700, 70.1200);
INSERT INTO `fas_fund_day_top` VALUES (265, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '010606', '创金合信鑫祥混合C', '2022-09-26', 1.0519, -0.2100, -0.8700, -0.7100, -0.5900, 2.0000, 6.2200, 0.0000, 0.0000, 0.1900, 5.1900);
INSERT INTO `fas_fund_day_top` VALUES (266, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '200015', '长城优化升级混合A', '2022-09-26', 5.1408, 2.4900, 3.8800, -4.7900, -6.8000, 6.2400, 6.1400, 66.9500, 158.2000, -9.4000, 475.2900);
INSERT INTO `fas_fund_day_top` VALUES (267, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '012954', '华泰柏瑞恒利混合C', '2022-09-26', 1.0501, -0.4700, -0.1800, 0.2200, 2.4200, 4.6800, 6.1200, 0.0000, 0.0000, 4.3700, 5.0100);
INSERT INTO `fas_fund_day_top` VALUES (268, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '000314', '招商瑞丰灵活配置混合发起式A', '2022-09-26', 1.8610, -0.6900, -0.5300, -1.9500, 1.4200, 0.5400, 6.1000, 18.6900, 32.6400, -0.5300, 116.7500);
INSERT INTO `fas_fund_day_top` VALUES (269, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '005903', '泰达宏利绩优混合A', '2022-09-26', 1.8849, 3.7100, 5.7500, -4.6200, 0.6800, 19.8400, 6.0900, 1.4500, 47.1200, 0.3200, 88.4900);
INSERT INTO `fas_fund_day_top` VALUES (270, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '003592', '华泰柏瑞享利混合C', '2022-09-26', 1.3498, -0.4000, -0.1200, 0.2700, 2.4600, 4.1700, 6.0400, 15.6200, 29.4100, 4.1800, 54.9300);
INSERT INTO `fas_fund_day_top` VALUES (271, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009124', '华泰保兴科荣混合A', '2022-09-26', 1.1887, -0.1800, -0.4000, -0.8000, -0.3100, 1.4200, 6.0400, 13.6400, 0.0000, 3.2200, 18.8600);
INSERT INTO `fas_fund_day_top` VALUES (272, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '012449', '广发睿毅领先混合C', '2022-09-26', 2.6893, 0.7600, -0.8000, 0.4400, 0.1200, 3.7500, 5.9700, 0.0000, 0.0000, 1.5700, -1.2700);
INSERT INTO `fas_fund_day_top` VALUES (273, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '012609', '安信稳健汇利一年持有混合A', '2022-09-26', 1.0668, -0.2800, -0.8700, -0.2000, 0.4000, 2.9200, 5.9500, 0.0000, 0.0000, 4.3500, 6.6800);
INSERT INTO `fas_fund_day_top` VALUES (274, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009125', '华泰保兴科荣混合C', '2022-09-26', 1.1859, -0.1700, -0.4000, -0.8100, -0.3400, 1.3800, 5.9300, 13.4200, 0.0000, 3.1500, 18.5800);
INSERT INTO `fas_fund_day_top` VALUES (275, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '008893', '创金合信鑫利混合A', '2022-09-26', 1.3198, 0.0200, 0.0300, 0.1400, 1.2700, 2.8600, 5.8100, 15.0800, 0.0000, 3.4500, 31.9800);
INSERT INTO `fas_fund_day_top` VALUES (276, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009098', '景顺长城价值领航混合', '2022-09-26', 1.3812, -1.6400, -1.3600, -3.2500, 4.1900, 6.2400, 5.6600, 18.4200, 0.0000, 3.6400, 38.1200);
INSERT INTO `fas_fund_day_top` VALUES (277, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '008894', '创金合信鑫利混合C', '2022-09-26', 1.3086, 0.0200, 0.0200, 0.2500, 1.3400, 2.8800, 5.6100, 14.4100, 0.0000, 3.4100, 30.8600);
INSERT INTO `fas_fund_day_top` VALUES (278, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009100', '安信稳健增利混合A', '2022-09-26', 1.2145, -0.3400, -0.9300, -0.3300, 0.3700, 2.6800, 5.6000, 17.8100, 0.0000, 4.1200, 21.4500);
INSERT INTO `fas_fund_day_top` VALUES (279, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '011442', '创金合信鑫瑞混合A', '2022-09-26', 1.0169, 0.1000, -0.3000, -1.8700, -2.6700, 0.7100, 5.5900, 0.0000, 0.0000, -3.0600, 1.6900);
INSERT INTO `fas_fund_day_top` VALUES (280, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002017', '招商瑞丰灵活配置混合发起式C', '2022-09-26', 1.7980, -0.7200, -0.5500, -2.0200, 1.2400, 5.6400, 5.5800, 17.5900, 30.6700, -0.9400, 51.3700);
INSERT INTO `fas_fund_day_top` VALUES (281, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '206002', '鹏华精选成长混合A', '2022-09-26', 2.9600, 0.8900, -0.1300, -8.7000, -3.3600, 9.0600, 5.5600, 16.9000, 100.8100, -5.8500, 196.0000);
INSERT INTO `fas_fund_day_top` VALUES (282, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009493', '大成尊享18月定开混合A', '2022-09-26', 1.1366, -0.4700, -0.2400, -0.9100, 2.2500, 4.9400, 5.5200, 13.6600, 0.0000, 5.3300, 13.6600);
INSERT INTO `fas_fund_day_top` VALUES (283, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '012610', '安信稳健汇利一年持有混合C', '2022-09-26', 1.0620, -0.2800, -0.8800, -0.2300, 0.3000, 2.7100, 5.5200, 0.0000, 0.0000, 4.0500, 6.2000);
INSERT INTO `fas_fund_day_top` VALUES (284, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '013274', '长城优化升级混合C', '2022-09-26', 5.1076, 2.4800, 3.8700, -4.8400, -6.9500, 5.9100, 5.5100, 0.0000, 0.0000, -9.7900, 4.5200);
INSERT INTO `fas_fund_day_top` VALUES (285, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '000574', '宝盈新价值混合A', '2022-09-26', 2.6320, -0.5700, -2.5200, -4.0500, -7.1900, 4.9400, 5.4900, 13.3500, 82.2700, -5.0200, 296.0400);
INSERT INTO `fas_fund_day_top` VALUES (286, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '008905', '嘉合锦鹏添利混合A', '2022-09-26', 1.1490, -0.1100, 0.0200, 0.3100, 1.9500, 5.5600, 5.4900, 15.7900, 0.0000, 5.8200, 14.9000);
INSERT INTO `fas_fund_day_top` VALUES (287, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '011997', '景顺长城安盈回报一年持有混合A', '2022-09-26', 1.0691, -0.6300, -0.1100, -1.9400, 0.7600, 2.0100, 5.4300, 0.0000, 0.0000, 2.6200, 6.9100);
INSERT INTO `fas_fund_day_top` VALUES (288, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '010944', '招商商业模式优选A', '2022-09-26', 1.0671, 2.7100, 3.9200, -6.3700, 1.0100, 24.8700, 5.2400, 0.0000, 0.0000, -3.4900, 6.7100);
INSERT INTO `fas_fund_day_top` VALUES (289, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '001816', '汇添富新睿精选混合A', '2022-09-26', 1.6170, -1.9400, -1.8800, 1.3800, 5.0000, 9.1100, 5.2000, 12.4500, 46.4400, 2.0800, 69.7300);
INSERT INTO `fas_fund_day_top` VALUES (290, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '000218', '国泰黄金ETF联接A', '2022-09-26', 1.4260, -0.5600, 0.3500, -1.2300, -2.2100, -3.8000, 5.1700, -4.2800, 9.4200, 3.3500, 42.6000);
INSERT INTO `fas_fund_day_top` VALUES (291, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '011443', '创金合信鑫瑞混合C', '2022-09-26', 1.0120, 0.1000, -0.3200, -1.9100, -2.7700, 0.5100, 5.1200, 0.0000, 0.0000, -3.3400, 1.2000);
INSERT INTO `fas_fund_day_top` VALUES (292, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '000535', '长盛航天海工装备灵活配置混合', '2022-09-26', 1.8620, -1.4800, -0.4800, 2.2500, 9.3400, 13.1900, 5.0800, 39.8000, 103.3200, -5.6700, 190.7000);
INSERT INTO `fas_fund_day_top` VALUES (293, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '008906', '嘉合锦鹏添利混合C', '2022-09-26', 1.1378, -0.1200, 0.0100, 0.2700, 1.8500, 5.3400, 5.0600, 14.8500, 0.0000, 5.5100, 13.7800);
INSERT INTO `fas_fund_day_top` VALUES (294, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '011998', '景顺长城安盈回报一年持有混合C', '2022-09-26', 1.0633, -0.6400, -0.1200, -1.9600, 0.6500, 1.8000, 5.0000, 0.0000, 0.0000, 2.3100, 6.3300);
INSERT INTO `fas_fund_day_top` VALUES (295, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '005686', '财通资管瑞享12个月定开混合A', '2022-09-23', 1.2848, 0.0000, -0.1600, -0.9100, 1.1700, 1.0900, 4.9500, 14.8400, 21.2100, 1.2100, 32.7100);
INSERT INTO `fas_fund_day_top` VALUES (296, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '002049', '融通新机遇灵活配置混合', '2022-09-26', 1.5340, -1.1600, -0.3900, 3.1600, 6.9000, 8.2600, 4.9200, 16.0400, 35.3900, 3.3000, 59.7300);
INSERT INTO `fas_fund_day_top` VALUES (297, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '006700', '红土创新稳健混合A', '2022-09-26', 1.4295, -0.7900, -0.6800, -1.1900, 1.2000, 5.0700, 4.8900, 18.6000, 37.2400, 0.9300, 42.9500);
INSERT INTO `fas_fund_day_top` VALUES (298, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '009494', '大成尊享18月定开混合C', '2022-09-26', 1.1229, -0.4900, -0.2600, -0.9700, 2.0800, 4.6100, 4.8900, 12.2900, 0.0000, 4.8600, 12.2900);
INSERT INTO `fas_fund_day_top` VALUES (299, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '004253', '国泰黄金ETF联接C', '2022-09-26', 1.4113, -0.5700, 0.3400, -1.2600, -2.3000, -3.9700, 4.8000, -4.9400, 8.2800, 3.0800, 31.5900);
INSERT INTO `fas_fund_day_top` VALUES (300, '2022-09-27 16:40:05', '2022-09-27 16:40:05', NULL, '007385', '华泰保兴安盈定开混合', '2022-09-26', 1.3335, -0.1900, -0.3900, -0.9900, 0.1500, 1.6600, 4.7700, 13.4900, 29.6800, 2.4900, 33.3400);
COMMIT;

-- ----------------------------
-- Table structure for fas_fund_stock
-- ----------------------------
DROP TABLE IF EXISTS `fas_fund_stock`;
CREATE TABLE `fas_fund_stock` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  `updated_at` datetime DEFAULT NULL COMMENT '更新时间',
  `deleted_at` datetime DEFAULT NULL COMMENT '删除时间',
  `fund_code` varchar(10) NOT NULL DEFAULT '' COMMENT '基金code',
  `stock_code` varchar(10) DEFAULT NULL COMMENT '股票code',
  `stock_name` varchar(10) DEFAULT NULL COMMENT '股票名称',
  `stock_exchange` varchar(10) DEFAULT NULL COMMENT '股票所属交易所，SZ:深圳 SH:上海 HK:港股',
  `percentage` decimal(4,2) DEFAULT NULL COMMENT '持仓占比(百分比)',
  `quantity` decimal(10,2) DEFAULT NULL COMMENT '持股数(万股)',
  `amount` decimal(10,2) DEFAULT NULL COMMENT '持股市值(万元)',
  `cut_off_date` char(10) DEFAULT NULL COMMENT '截止时间',
  PRIMARY KEY (`id`),
  KEY `idx_fas_fund_stock_stock_code` (`stock_code`),
  KEY `idx_fas_fund_stock_deleted_at` (`deleted_at`),
  KEY `idx_fas_fund_stock_fund_code` (`fund_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='基金持仓表';

-- ----------------------------
-- Records of fas_fund_stock
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for fas_stock
-- ----------------------------
DROP TABLE IF EXISTS `fas_stock`;
CREATE TABLE `fas_stock` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  `updated_at` datetime DEFAULT NULL COMMENT '更新时间',
  `deleted_at` datetime DEFAULT NULL COMMENT '删除时间',
  `code` varchar(10) DEFAULT NULL COMMENT '股票代码',
  `name` varchar(50) DEFAULT NULL COMMENT '股票名称',
  `industry` varchar(20) DEFAULT NULL COMMENT '所属行业',
  `exchange_code` varchar(5) DEFAULT NULL COMMENT '所属交易所，SZ:深圳 SH:上海 HK:港股',
  `tag` text COMMENT '所属概念',
  `set_up_date` char(10) DEFAULT NULL COMMENT '公司成立时间',
  `market_date` char(10) DEFAULT NULL COMMENT '上市时间',
  `market_pe` decimal(10,2) DEFAULT NULL COMMENT '发行市盈率',
  `market_quantity` decimal(10,2) DEFAULT NULL COMMENT '发行量(万股)',
  `market_price` decimal(10,2) DEFAULT NULL COMMENT '发行价格',
  `market_amount` decimal(10,2) DEFAULT NULL COMMENT '实际募资(亿)',
  `company` varchar(255) DEFAULT NULL COMMENT '公司名称',
  `employees` bigint unsigned DEFAULT NULL COMMENT '公司员工',
  `money_unit` varchar(10) DEFAULT NULL COMMENT '货币单位',
  PRIMARY KEY (`id`),
  UNIQUE KEY `code` (`code`),
  KEY `idx_fas_stock_deleted_at` (`deleted_at`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='股票表';

-- ----------------------------
-- Records of fas_stock
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for fas_stock_quotes
-- ----------------------------
DROP TABLE IF EXISTS `fas_stock_quotes`;
CREATE TABLE `fas_stock_quotes` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  `updated_at` datetime DEFAULT NULL COMMENT '更新时间',
  `deleted_at` datetime DEFAULT NULL COMMENT '删除时间',
  `stock_code` bigint unsigned DEFAULT NULL COMMENT '股票ID',
  `record_date` char(10) DEFAULT NULL COMMENT '记录时间',
  `total_quantity` decimal(10,2) DEFAULT NULL COMMENT '总股本(万股)',
  `total_amount` decimal(10,2) DEFAULT NULL COMMENT '总市值(亿元)',
  `circulate_quantity` decimal(10,2) DEFAULT NULL COMMENT '流通股本(万股)',
  `circulate_amount` decimal(10,2) DEFAULT NULL COMMENT '流通市值(亿)',
  `today_open_price` decimal(10,2) DEFAULT NULL COMMENT '今日开盘价格',
  `today_max_price` decimal(10,2) DEFAULT NULL COMMENT '今日最高价格',
  `today_price` decimal(10,2) DEFAULT NULL COMMENT '今日收盘价格',
  `last_price` decimal(10,2) DEFAULT NULL COMMENT '昨日收盘价格',
  `money_unit` varchar(10) DEFAULT NULL COMMENT '货币单位',
  `change_ratio` decimal(5,2) DEFAULT NULL COMMENT '换手率(百分比)',
  `dynamic_pe` decimal(10,2) DEFAULT NULL COMMENT '市盈率(动)',
  `static_pe` decimal(10,2) DEFAULT NULL COMMENT '市盈率(静)',
  `pe_ttm` decimal(10,2) DEFAULT NULL COMMENT '市盈率(TTM)',
  `pb` decimal(10,2) DEFAULT NULL COMMENT '市净率',
  `earnings_per_share` decimal(10,2) DEFAULT NULL COMMENT '每股收益',
  `net_assets_per_share` decimal(10,2) DEFAULT NULL COMMENT '每股净资产',
  `dividends` decimal(10,2) DEFAULT NULL COMMENT '股息(TTM)',
  `dividends_ratio` decimal(5,2) DEFAULT NULL COMMENT '股息率(TTM)',
  PRIMARY KEY (`id`),
  KEY `idx_fas_stock_quotes_deleted_at` (`deleted_at`),
  KEY `idx_fas_stock_quotes_stock_code` (`stock_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='股票行情表';

-- ----------------------------
-- Records of fas_stock_quotes
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for fas_user
-- ----------------------------
DROP TABLE IF EXISTS `fas_user`;
CREATE TABLE `fas_user` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  `updated_at` datetime DEFAULT NULL COMMENT '更新时间',
  `deleted_at` datetime DEFAULT NULL COMMENT '删除时间',
  `nick_name` varchar(20) NOT NULL DEFAULT '' COMMENT '昵称',
  `phone` char(11) DEFAULT NULL COMMENT '手机号',
  `password` varchar(40) DEFAULT NULL COMMENT '密码',
  `status` tinyint DEFAULT '1' COMMENT '状态 1:正常 2:白名单 3:黑名单',
  PRIMARY KEY (`id`),
  UNIQUE KEY `phone` (`phone`),
  KEY `idx_fas_user_deleted_at` (`deleted_at`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb3 COMMENT='用户表';

-- ----------------------------
-- Records of fas_user
-- ----------------------------
BEGIN;
INSERT INTO `fas_user` VALUES (1, '2022-09-27 18:08:57', '2022-09-27 18:08:57', NULL, '小山', '18810877074', '123456', 1);
COMMIT;

-- ----------------------------
-- Table structure for fas_user_info
-- ----------------------------
DROP TABLE IF EXISTS `fas_user_info`;
CREATE TABLE `fas_user_info` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `created_at` datetime DEFAULT NULL COMMENT '创建时间',
  `updated_at` datetime DEFAULT NULL COMMENT '更新时间',
  `deleted_at` datetime DEFAULT NULL COMMENT '删除时间',
  `uid` bigint unsigned DEFAULT NULL COMMENT '用户id',
  `birthday` varchar(10) DEFAULT NULL COMMENT '生日',
  `address` text COMMENT '地址',
  PRIMARY KEY (`id`),
  KEY `idx_fas_user_info_deleted_at` (`deleted_at`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb3 COMMENT='用户信息表';

-- ----------------------------
-- Records of fas_user_info
-- ----------------------------
BEGIN;
INSERT INTO `fas_user_info` VALUES (1, '2022-09-27 18:08:57', '2022-09-27 18:08:57', NULL, 1, '', '');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
